//Distinct Count
EmailEvents
| summarize QuaratineEmails = count_distinct(DeliveryLocation == "Quarantine"),
    Emails = count_distinct(DeliveryLocation == "Inbox/folder"),
    JunkEmails = count_distinct(DeliveryLocation == "Junk folder")by SenderFromAddress

//Count of all Senders and where they were delivered
EmailEvents
| summarize QuaratineEmails = count(DeliveryLocation == "Quarantine"),
    Emails = count(DeliveryLocation == "Inbox/folder"),
    JunkEmails = count(DeliveryLocation == "Junk folder")by SenderFromAddress