DeviceEvents 
| where ActionType startswith "ASR"
| extend Fields=parse_json(AdditionalFields)
| extend IsAudit = tostring(Fields.IsAudit)
| where IsAudit == "false"
| project Timestamp, DeviceName, ActionType, IsAudit, ReportId, DeviceId