//Find all devices that are not onboarded
DeviceInfo
| extend Date = format_datetime(Timestamp, "MM/dd/yyyy")
| where OnboardingStatus <> "Onboarded"
| where Timestamp > ago(1d)
| distinct DeviceName, Date, OnboardingStatus, Timestamp