//Show usb mounted devices and drive letters
DeviceEvents
| where ActionType contains "USB"
| extend DriveLetter = tostring(todynamic(AdditionalFields).DriveLetter)
| distinct DeviceName, ActionType, DriveLetter, Timestamp