DeviceNetworkEvents 
| where RemoteUrl <> ""
| extend TimeStampformated=format_datetime(Timestamp,'MM/dd/yyyy HH:mm tt')
| join kind=leftouter (DeviceEvents
    | where ActionType == 'SmartScreenUrlWarning' or ActionType == 'ExploitGuardNetworkProtectionBlocked'
    | extend A=parse_json(AdditionalFields)
    | extend TimeStampformated=format_datetime(Timestamp,'MM/dd/yyyy HH:mm tt')
    ) on DeviceName, RemoteUrl, InitiatingProcessFileName, InitiatingProcessAccountName, TimeStampformated
| where InitiatingProcessFileName == "msedge.exe" or InitiatingProcessFileName == "chrome.exe"
//| where RemoteUrl contains "facebook"
//| where InitiatingProcessAccountName contains "Matt"
//| where ActionType1 <> ""
| distinct TimeStampformated,DeviceName, Action=ActionType1, URL_IPAddress=RemoteIP, URL=RemoteUrl, Username=InitiatingProcessAccountName, Browser=InitiatingProcessFileName
| order by TimeStampformated desc  